[
  { "page": 1, "text": "" },
  { "page": 2, "text": "Once upon a time, there was a sweet mama pig who had three little piggies she loved very much. But there wasn’t enough food for them all. So one day, she kissed them on their little snouts and said, 'My darlings, it’s time for you to go out into the big, wide world and build your own homes!'" },
  { "page": 3, "text": "The first little piggy, named Snuggles, didn’t like to work. 'I’ll just build a quick and easy house out of straw!' he said. It was done in no time, and he felt very proud. 'Now I can nap all day!' he thought." },
  { "page": 4, "text": "The second little piggy, named Wiggles, was a little less lazy than Snuggles. 'Sticks are stronger than straw!' he said. He built his stick house quickly, then danced around singing, 'This house is fine for me!'" },
  { "page": 5, "text": "The third little piggy, named Tuffy, was the cleverest of them all. 'I want a house that will keep me safe no matter what!' he said. So, he worked hard, laying brick by brick, until he built a strong and cozy house with a fireplace and chimney." },
  { "page": 6, "text": "One day, a sneaky, hungry wolf came strolling down the lane. 'Oh, what’s this? A house made of straw? I bet a juicy little piggy lives inside!' he thought, licking his sharp teeth." },
  { "page": 7, "text": "The wolf knocked on Snuggles’ door and said in his best fake-friendly voice, 'Little pig, little pig, let me in!' Snuggles peeked through the door and saw the wolf’s furry paws. 'No, no, no! Not by the hairs on my chinny chin chin!' he squealed." },
  { "page": 8, "text": "'Then I’ll huff, and I’ll puff, and I’ll blow your house down!' growled the wolf. He blew with all his might, and the straw house flew apart like confetti. Snuggles squealed and ran as fast as his little legs could carry him to Wiggles’ stick house." },
  { "page": 9, "text": "The wolf, feeling hungrier than ever, spotted the stick house. 'Two piggies in one house? What a feast this will be!' he said, his tummy rumbling." },
  { "page": 10, "text": "He knocked on the stick house door. 'Little pigs, little pigs, let me in!' he called sweetly. But Snuggles and Wiggles peeked out and saw his sharp claws. 'No, no, no! Not by the hairs on our chinny chin chins!' they shouted." },
  { "page": 11, "text": "'Then I’ll huff, and I’ll puff, and I’ll blow your house down!' roared the wolf. He huffed, puffed, and blew until the stick house crumbled into a pile of twigs. The two pigs squealed and ran off to Tuffy’s brick house." },
  { "page": 12, "text": "The wolf chased them all the way to the sturdy brick house. 'You can’t escape me, little piggies!' he snarled. But the clever pigs slammed the door shut just in time." },
  { "page": 13, "text": "Inside, the three pigs huddled together. 'He’s so mean and scary!' said Snuggles. 'Don’t worry,' said Tuffy. 'My house is strong. He can’t get us here!'" },
  { "page": 14, "text": "The wolf knocked on the brick house door. 'Little pigs, little pigs, let me in!' he demanded. The three pigs giggled and said, 'No, no, no! Not by the hairs on our chinny chin chins!'" },
  { "page": 15, "text": "'Then I’ll huff, and I’ll puff, and I’ll blow your house down!' the wolf growled. He huffed and puffed, but the brick house stood tall and strong. No matter how hard he blew, the house didn’t budge an inch." },
  { "page": 16, "text": "The wolf, out of breath, sat down to think. 'Hmm, I’ll go down the chimney!' he decided, rubbing his paws together. 'They’ll never see me coming!'" },
  { "page": 17, "text": "Tuffy heard the wolf climbing onto the roof. 'Quick, let’s make a fire!' he said. The pigs lit a roaring fire in the fireplace and put a big pot of water on to boil. 'We’ll teach that wolf a lesson!'" },
  { "page": 18, "text": "As the wolf slid down the chimney, the clever pigs pulled off the pot’s lid. 'Splash!' The wolf landed right in the boiling water and yelped, 'Ouch, ouch, ouch!' He scrambled back up the chimney and ran far, far away." },
  { "page": 19, "text": "The three pigs danced and cheered. 'We’re safe! We’re safe!' they sang. From that day on, they lived happily ever after in their strong, cozy brick house, never afraid of the wolf again." },
  { "page": 20, "text": "And so, Snuggles, Wiggles, and Tuffy learned that hard work always pays off. The end." }
]
